{
    "pages" : {
        "education" : {
            "main_title" : "Education",
            "infos" : [
                {
                    "title": "High school diploma",
                    "year": "2013", 
                    "subtitle": "ITN Leone Acciaiuoli - Ortona",
                    "parag": "Aspiring cadet in command of merchant ships"
                },
                {
                    "title": "Bachelor's degree",
                    "year": "2019", 
                    "subtitle": "University of Pisa - Computer Engineering",
                    "parag": "Three-year degree with graduation mark of 99/110"
                }
            ]

        },
        "experience" : {
            "main_title" : "Experience",
            "infos" : [
                {
                    "title": "Development of a software operating in the maritime sector",
                    "year": "03/2017 05/2017", 
                    "subtitle": "Internship - Genesy s.r.l. - Pisa",
                    "parag": "For the calculation of the inclination of a boat, using data from Accelerometer and Gyroscope. Use of a Sensor Fusion algorithm based on Kalman filter, to process the measurements given by the two sensors in order to avoid typical errors in the use of individual components.",
                    "technologies": "C Programming language"
                },
                {
                    "title": "Development and Management of a relational database related to a business reality",
                    "year": "03/2018 06/2018", 
                    "subtitle": "Training Project - University of Pisa - Pisa",
                    "parag": "Design and creation of a database related to a gyms company operating (ideally) at a national level, with various locations and services offered.",
                    "technologies": "MySQL | E-R diagrams | Software engineering tools"
                },
                {
                    "year":"10/2018 02/2019",
                    "title":"Design and Development of a Client-Server Application",
                    "subtitle":"Training Project - University of Pisa - Pisa",
                    "parag":"For data exchange via TFTP protocol, using Multi-Process programming and Program Interruption mechanisms",
                    "technologies":"C Programming language"
                },
                {
                    "year":"05/2019 08/2019",
                    "title":"Design and Development of a WEB Application for the management of a Gym",
                    "subtitle":"Training Project - University of Pisa - Pisa",
                    "parag":"Implementation of the Front-End and Back-End levels of the service, with database management to meet data consistency requirements",
                    "technologies":"HTML5 | CSS3 | PHP | Javascript | MySQL"
                },
                {
                    "year":"07/2019 12/2020",
                    "title":"Design, Development and Maintenance of a tool for loading and managing dynamic online questionnaires",
                    "subtitle":"Thesis and Work Project - IIT, CNR - Pisa",
                    "parag":"Implementation of the upload system of a .CSV file that dynamically generates a questionnaire. Design according to the phases of Software Engineering, actual development of the service (back-end and front-end) and subsequent extension by adding modules for managing compilations",
                    "technologies":"Java (Springboot, Hibernate framework) | MySQL | HTML | CSS3 | JSP | NodeJs | Javascript ES6"
                },
                {
                    "year":"10/2019 12/2020",
                    "title":"Design and development of various web platforms related to work projects",
                    "subtitle":"Work Projects - IIT, CNR - Pisa",
                    "parag":"Implementation of back-end and front-end web platforms using REST architecture",
                    "technologies":"Java (Springboot Framework) | NodeJs (Express) | MySQL | HTML | CSS3 | JSP | NodeJs | Javascript ES6"
                },
                {
                    "year":"10/2019 12/2020",
                    "title":"Experience in managing Apache2 and Tomcat web servers",
                    "subtitle":"Work Projects - IIT, CNR - Pisa",
                    "parag":"Management of Apache2 web servers to provide Java and NodeJs web services",
                    "technologies":"Apache2 | Tomcat"
                }
            ]
        },
        "interests" : {
            "main_title" : "Interests",
            "infos" : [
                {
                    "title": "My Portfolio",
                    "year": "2020", 
                    "subtitle": "Personal Project - Pisa",
                    "parag": "The passion for web-design has always led me to experiment and play with Front-End technologies in the IT field. The birth of frameworks that make the world of Front-End programming more structured and \"Object-Oriented \" has been a huge source of inspiration for me and this has prompted me to learn ReactJs and the new powerful standards CSS3, HTML5 and JS ES6 . Thus was born my virtual Curriculum Vitae, through which I want to show not only my work and university experience, but also what I am passionate about: a project free from the constraints that too often, in our work, cut the wings of creativity. This site is fully developed using the technologies mentioned, the github repo is public and can be visited entirely in my GitHub Profile",
                    "technologies":"Javascript ES6 (ReactJs) | HTML5 | CSS3"
                }
            ]
        },
        "skills" : {
            "main_title_skills" : "Skills",
            "main_title_languages" : "Languages",
            "infos_skills": {
                "programming": ["Java","C","C++17", "HTML5", "CSS3", "Javascript ES6", "PHP", "MySQL", "Python"],
                "os": ["Linux", "Windows"],
                "frameworks": ["Java Springboot", "Java Hibernate", "ReactJs", "NodeJs"],
                "others": ["GIT", "Apache2", "Tomcat", "Office Suite", "LaTeX", "GiMP"]
            },
            "infos_language" : {
                
                    "ita_lang_info" : "Native Speaking",
                    "eng_lang_info" : "Intermediate"
                 
            }
        }
    }
}