{
    "pages" : {
        "education" : {
            "main_title" : "Carriera",
            "infos" : [
                {
                    "title": "Diploma di scuola secondaria di secondo grado",
                    "year": "2013", 
                    "subtitle": "ITN Leone Acciaiuoli - Ortona",
                    "parag": "Aspirante al comando di Navi Mercantili"
                },
                {
                    "title": "Laurea di Primo Livello",
                    "year": "2019", 
                    "subtitle": "Università di Pisa - Ingegneria Informatica",
                    "parag": "Dottore Triennale in Ingegneria Informatica con votazione 99/110"
                }
            ]

        },
        "experience" : {
            "main_title" : "Esperienza",
            "infos" : [
                {
                    "title": "Sviluppo di un'Applicazione operante in ambito marittimo",
                    "year": "03/2017 05/2017", 
                    "subtitle": "Tirocinio Formativo - Genesy s.r.l. - Pisa",
                    "parag": "Per il calcolo dell'inclinazione di un'imbarcazione, utilizzando dati provenienti da Accelerometro e Giroscopio. Utilizzo di un algoritmo di Sensor Fusion basato su Filtro di Kalman, per Gestione e Rielaborazione delle misurazioni date dai sensori al fine di fornire misurazioni esenti da errori tipici presenti nell'utilizzo singolo dei componenti.",
                    "technologies": "Linguaggio C"
                },
                {
                    "title": "Sviluppo e Gestione di un database relazionale relativo ad una realtà aziendale",
                    "year": "03/2018 06/2018", 
                    "subtitle": "Progetto Formativo - Università di Pisa - Pisa",
                    "parag": "Progettazione e successiva creazione del database relativo ad una società di palestre operante (idealmente) a livello nazionale, con varie sedi e servizi offerti.",
                    "technologies": "MySQL | Diagrammi E-R | Strumenti dell'Ingegneria del software"
                },
                {
                    "year":"10/2018 02/2019",
                    "title":"Progettazione e Sviluppo di una Applicazione Client-Server",
                    "subtitle":"Progetto Formativo - Università di Pisa - Pisa",
                    "parag":"Per scambio dati tramite protocollo TFTP, utilizzando meccanismi di programmazione Multi-Processo ed Interruzione di Programma",
                    "technologies":"Linguaggio C"
                },
                {
                    "year":"05/2019 08/2019",
                    "title":"Progettazione e Sviluppo di una Applicazione WEB di gestione di una Palestra",
                    "subtitle":"Progetto Formativo - Università di Pisa - Pisa",
                    "parag":"Implementazione dei livelli di Front-End e Back-End del servizio, con gestione del database per soddisfare requisiti di consistenza dei dati",
                    "technologies":"HTML5 | CSS3 | PHP | Javascript | MySQL"
                },
                {
                    "year":"07/2019 12/2020",
                    "title":"Progettazione, Sviluppo e Manutenzione di un tool per caricamento e gestione di questionari dinamici online",
                    "subtitle":"Progetto di Tesi e Progetto Lavorativo - IIT, CNR - Pisa",
                    "parag":"Implementazione del sistema di upload di un file .CSV che genera dinamicamente un questionario. Progettazione del tool secondo le fasi proprie dell'Ingegneria del Software, successiva implementazione del servizio (back-end e front-end) e successiva estensione tramite aggiunta di moduli per la gestione delle compilazioni",
                    "technologies":"Java (framework Springboot, Hibernate) | MySQL | HTML | CSS3 | JSP | NodeJs | Javascript ES6"
                },
                {
                    "year":"10/2019 12/2020",
                    "title":"Progettazione e Sviluppo di varie piattaforme web relative a progetti lavorativi",
                    "subtitle":"Progetti Lavorativi - IIT, CNR - Pisa",
                    "parag":"Implementazione di piattaforme web a livello Back-end e Front-end utilizzando architettura REST",
                    "technologies":"Java (framework Springboot) | NodeJs (Express) | MySQL | HTML | CSS3 | JSP | NodeJs | Javascript ES6"
                },
                {
                    "year":"10/2019 12/2020",
                    "title":"Esperienza nella gestione di server web Apache2 e Tomcat",
                    "subtitle":"Progetti Lavorativi - IIT, CNR - Pisa",
                    "parag":"Gestione di server web Apache2 in ambito lavorativo per fornire servizi web implementati in Java o NodeJs",
                    "technologies":"Apache2 | Tomcat"
                }
            ]
        },
        "interests" : {
            "main_title" : "Interessi",
            "infos" : [
                {
                    "title": "Il mio Portfolio",
                    "year": "2020", 
                    "subtitle": "Progetto Personale - Pisa",
                    "parag": "La passione per il web-design mi ha da sempre portato a sperimentare e giocare con tecnologie Front-End in ambito informatico. La nascita di frameworks che rendono il mondo della programmazione Front-End più strutturata e \"Object-Oriented\" è stata una fonte di ispirazione enorme per me e questo mi ha spinto ad imparare ReactJs e i nuovi potenti standard CSS3, HTML5 e JS ES6. Nasce così questo mio Curriculum Vitae virtuale, tramite il quale voglio mostrare non solo la mia esperienza lavorativa e universitaria, ma anche cio' che mi appassiona: un progetto esente dai vincoli che troppo spesso, nel nostro lavoro, tarpano le ali della creatività. Questo sito è completamente sviluppato utilizzando le tecnologie citate, la repo github è pubblica ed interamente visitabile al link []",
                    "technologies":"Javascript ES6 (ReactJs) | HTML5 | CSS3"
                }
            ]
        },
        "skills" : {
            "main_title_skills" : "Skills",
            "main_title_languages" : "Lingue",
            "infos_skills": {
                "programming": ["Java","C","C++17", "HTML5", "CSS3", "Javascript ES6", "PHP", "MySQL", "Python"],
                "os": ["Linux", "Windows"],
                "frameworks": ["Java Springboot", "Java Hibernate", "ReactJs", "NodeJs"],
                "others": ["GIT", "Apache2", "Tomcat", "Office Suite", "LaTeX", "GiMP"]
            },
            "infos_language" : {
                   "ita_lang_info" : "Madrelingua",
                   "eng_lang_info" : "Livello Intermedio"
            }
        }

    }
}